[
    {
        "startYear": "SEPT 2022",
        "endYear": "DEC 2023",
        "companyName": "SNAPSHEET",
        "jobTitle": "SOFTWARE ENGINEER",
        "description": [ 
            "Developed XGBoost and classification models leveraging NLP methodologies to analyze vehicle damage descriptions, achieving an accuracy of 87% in predicting vehicle’s potential total loss.",  
            "Developed image classification models to categorize damaged vehicle parts from images, achieving a high accuracy rate of 96%, reducing claim’s processing time by 80%.",  
            "Refined and analyzed over 600 datasets using Jupyter Notebook, Scikit-learn, and Matplotlib, applying advanced filtering techniques to enhance data quality.",  
            "Built and optimized AWS cloud CI/CD pipelines, standardizing infrastructure updates and reducing deployment time by 60%, resulting in faster and more reliable feature releases.",  
            "Implemented New Relic and CloudWatch monitoring dashboards and alerts with optimized SQL queries, enabling real-time tracking of product usage and efficiency, resulting in reducing error rates.",  
            "Developed claim components for United State’s top Auto insurance providers, ensuring seamless integration with large datasets while maintaining an intuitive design and response time, leveraging React.js best practices."  
            ],
        "logo": "snapsheet-logo.png",
        "companySite":"https://www.snapsheetclaims.com/",
        "backdrop": "#2ca1c5db"
    },
    {
        "startYear": "SEPT 2018",
        "endYear": "AUG 2022",
        "companyName": "MORNINGSTAR INC",
        "jobTitle": "SENIOR SOFTWARE ENGINEER",
        "description": [
            "Played a pivotal role in developing market dashboards featuring multiple tiles, rendering comprehensive security data for Morningstar Research products. Developed dynamic charts, tables, and list views for quotes, indexes, watchlists, commodities, currencies, and articles, presented in a user-friendly format using Vue.js and VueX store for state management.",
            "Engineered a highly interactive and performative screener tool APIs and UI components empowering users to select investments to conduct in-depth research.",
            "Incorporated over 200 data points for detailed analysis, enabling instant data rendering through AWS Elasticsearch query.",
            "Created independent UI components and webpages in Vue.js, adhering to Morningstar design standards, enhancing the user experience, and ensuring consistency across Morningstar Research, Morningstar Direct, and Morningstar.com platforms.",
            "Spearheaded cross-team collaboration initiatives, leveraging mentorship roles to foster cohesive integration among diverse departments, ensuring alignment in project goals and delivering unified solutions.",
            "Leveraging expertise as a Senior Software Engineer to facilitate their onboarding process and expedite their integration into the team. Ensured a smooth transition, fostering a collaborative environment while imparting valuable knowledge and skills.",
            "Organized and led educational virtual reality(Unity) and cloud development workshops, and finance talks, and conducted and organized Conferences for further industry exposure."
        ],
        "logo": "morningstar-logo.jpeg",
        "companySite": "https://www.morningstar.com/company",
        "backdrop": "#fe000085"
    },
    {
        "startYear": "JUNE 2021",
        "endYear": "OCT 2021",
        "companyName": "XRTerra",
        "jobTitle": "XR DEVELOPER PROGRAM",
        "description": [
            "Created extended reality applications.",
            "VR Development - Developed multiple applications in a virtual stimulations for individuals using Oculus Quest 2",
            "AR Development - Developed multiple applications to create digital experiences"
        ],
        "logo": "xrterra-blue-logo.png",
        "companySite": "https://www.xrterra.com/",
        "backdrop": "#2ca1c5db"
    },
    {
        "startYear": "OCT 2017",
        "endYear": "AUG 2018",
        "companyName": "CHICAGO TRANSIT AUTHORITY",
        "jobTitle": "ANDROID DEVELOPER",
        "description": [
            "Developed a background service for Android devices which notifies the continual connectivity to the CTA network as means of laying the groundwork for future deployment of tablets to CTA Bus Service Management.",
            "Developed CTA’s Santa Printer Application by integrating critical permissions, Camera2 API, and customized special event bitmaps, allowing CTA riders traveling on special event trains to capture, customize, and print images.",
            "Assisted Planning and Operations Department to develop a web framework to create and update reroute changes for CTA buses.",
            "Developed and implemented algorithms to generate PDF based on multiple reroutes.",
            "Managed the Oracle database to load previous bulletin data for reuse.",
            "Wrote test cases for different segments of bulletins to detect errors."
        ],
        "logo": "cta-logo.png",
        "companySite": "https://www.transitchicago.com/",
        "backdrop": "#0078c2"
    },
    {
        "startYear": "JAN 2017",
        "endYear": "AUG 2017",
        "companyName": "UNIVERSITY OF ILLIONIS AT CHICAGO",
        "jobTitle": "WEB DEVELOPER",
        "description": [
            "Provided maintenance, development and written well designed, testable, efficient code by using best software development practices.",
            "Created website layout/user interfaces by using standard HTML5/CSS3 practices.",
            "Integrated data from various back-end services and databases."
        ],
        "logo": "uic-logo.png",
        "companySite": "https://www.uic.edu/",
        "backdrop": "#fe000085"
    }
]